Repository: bdach/knowledge-representation
Catalog: src/ConcurrentActions/Client/Localization/Locale.*.resx
Languages: pl_pl

source: AccessibilityQuery
pl_pl: Kwerenda osiągalności

source: AccessibilityQueryScreenTip
pl_pl: Określa, czy podany warunek logiczny jest osiągalny poprzez wykonanie pewnego programu ze stanu początkowego.

source: Action
pl_pl: Akcja

source: ActionDomainGroupBox
pl_pl: Domena akcji

# ActionDropDown
source: AddActionButton
pl_pl: Akcje

source: ActionDropdownScreenTip
pl_pl: Umożliwia dodanie nowej akcji lub wstawienie istniejącej akcji do zdania domeny akcji lub kwerendy.

source: ActionScreenTip
pl_pl: Akcja, z którą związane jest dane zdanie.

source: AddActionButton
pl_pl: Dodaj nową

source: AddActionCancelButton
pl_pl: Anuluj

source: AddActionConfirmButton
pl_pl: Dodaj

source: AddActionPrompt
pl_pl: Wpisz unikalną nazwę akcji

source: AddActionStatementDropDown
pl_pl: Dodaj zdanie domeny akcji

source: AddActionStatementDropDownScreenTip
pl_pl: Wstawia zdanie domeny akcji do edytowanego scenariusza.

source: AddActionTitle
pl_pl: Dodaj nową akcję

source: AddCompoundActionButton
pl_pl: Dodaj akcję złożoną

source: AddFluentButton
pl_pl: Dodaj nowy

source: AddFluentCancelButton
pl_pl: Anuluj

source: AddFluentConfirmButton
pl_pl: Dodaj

source: AddFluentPrompt
pl_pl: Wpisz unikalną nazwę fluenta

source: AddFluentTitle
pl_pl: Dodaj nowy fluent

source: AddQueryStatementDropDown
pl_pl: Dodaj kwerendę

source: AddQueryStatementDropDownScreenTip
pl_pl: Wstawia kwerendę do edytowanego scenariusza.

source: AlternativeButton
pl_pl: Alternatywa

source: AlternativeButtonScreenTip
pl_pl: Wstawia alternatywę do wybranej formuły logicznej.

source: CalculateButton
pl_pl: Wykonaj obliczenia

source: CalculateButtonScreenTip
pl_pl: Dokonuje ewaluacji kwerend na podstawie wprowadzonej domeny akcji.

source: ChooseLanguage
pl_pl: Ustaw język

source: ClearButton
pl_pl: Wyczyść

source: ClearButtonScreenTip
pl_pl: Usuwa wszystkie fluenty, akcje, zdania domeny akcji i kwerendy z obecnie edytowanego scenariusza.

source: CloseButton
pl_pl: Zakończ

source: CloseButtonScreenTip
pl_pl: Zamyka aplikację.

source: ConditionalEffectStatement
pl_pl: Warunkowe zdanie efektu

source: ConditionalEffectStatementScreenTip
pl_pl: Opisuje efekty akcji, które zachodzą pod warunkiem spełnienia pewego warunku wstępnego.

source: ConditionalFluentReleaseStatement
pl_pl: Warunkowe zdanie uwolnienia fluentu

source: ConditionalFluentReleaseStatementScreenTip
pl_pl: Opisuje losowe efekty akcji, które zachodzą pod warunkiem spełnienia pewnego warunku wstępnego.

source: ConditionalImpossibilityStatement
pl_pl: Warunkowe zdanie niemożliwości

source: ConditionalImpossibilityStatementScreenTip
pl_pl: Zapobiega wykonaniu akcji pod warunkiem spełnienia pewnego warunku wstępnego.

source: ConjunctionButton
pl_pl: Koniunkcja

source: ConjunctionButtonScreenTip
pl_pl: Wstawia koniunkcję do wybranej formuły logicznej.

source: Constraint
pl_pl: Warunek integralności

source: ConstraintScreenTip
pl_pl: Warunek logiczny, który musi być spełniony w każdym stanie.

source: ConstraintStatement
pl_pl: Zdanie ograniczenia

source: ConstraintStatementScreenTip
pl_pl: Zapewnia spełnienie pewnego warunku logicznego we wszystkich możliwych stanach.

source: EditTab
pl_pl: Edycja

source: EffectStatement
pl_pl: Zdania efektu

# EquivalenceButton
source: EquivalencyButton
pl_pl: Równoważność

source: EquivalenceButtonScreenTip
pl_pl: Wstawia równoważność do wybranej formuły logicznej.

source: ExecutabilityQuery
pl_pl: Kwerendy wykonywalności

source: ExistentialExecutabilityQuery
pl_pl: Egzystencjalna kwerenda wykonywalności

source: ExistentialExecutabilityQueryScreenTip
pl_pl: Określa, czy podany program jest kiedykolwiek wykonywalny w całości ze stanu początkowego.

source: ExistentialValueQuery
pl_pl: Egzystencjalna kwerenda wartości

source: ExistentialValueQueryScreenTip
pl_pl: Określa, czy po wykonaniu podanego programu kiedykolwiek spełniony jest pewien warunek logiczny.

source: ExportButton
pl_pl: Eksportuj do pliku

source: ExportButtonScreenTip
pl_pl: Zapisuje dane obecnie edytowanego scenariusza do pliku.

source: FalsityButton
pl_pl: Fałsz

source: FalsityButtonScreenTip
pl_pl: Wstawia stałą fałszu do wybranej formuły logicznej.

source: FluentDropDown
pl_pl: Fluenty

source: FluentDropDownScreenTip
pl_pl: Umożliwia dodanie nowego fluentu lub wstawienie istniejącego fluentu do zdania domeny akcji lub kwerendy.

source: FluentReleaseStatement
pl_pl: Zdania uwolnienia fluentu

source: FluentScreenTip
pl_pl: Fluent, na który ma wpływ dane zdanie.

source: FluentSpecificationStatement
pl_pl: Zdanie specyfikacji fluentu

source: FluentSpecificationStatementScreenTip
pl_pl: Specyfikuje, że dany fluent nie podlega prawu inercji.

source: FormulaGroupBox
pl_pl: Edytor formuł

source: GeneralExecutabilityQuery
pl_pl: Ogólna kwerenda wykonywalności

source: GeneralExecutabilityQueryScreenTip
pl_pl: Określa, czy podany program jest zawsze wykonywalny w całości ze stanu początkowego.

source: GeneralValueQuery
pl_pl: Ogólna kwerenda wartości

source: GeneralValueQueryScreenTip
pl_pl: Określa, czy po wykonaniu podanego programu zawsze spełniony jest pewien warunek logiczny.

source: ImplicationButton
pl_pl: Implikacja

source: ImplicationButtonScreenTip
pl_pl: Wstawia implikację do wybranej formuły logicznej.

source: ImportButton
pl_pl: Importuj z pliku

source: ImportButtonScreenTip
pl_pl: Wczytuje dane scenariusza z pliku.

source: InitialCondition
pl_pl: Warunek początkowy

source: InitialConditionScreenTip
pl_pl: Warunek logiczny, który musi być spełniony w stanie początkowym.

source: InitialValueStatement
pl_pl: Zdanie wartości początkowej

source: InitialValueStatementScreenTip
pl_pl: Zapewnia spełnienie pewnego warunku logicznego w stanie początkowym.

source: LanguageGroupBox
pl_pl: Sygnatura języka

source: NegationButton
pl_pl: Negacja

source: NegationButtonScreenTip
pl_pl: Wstawia negację do wybranej formuły logicznej.

source: ObservationCondition
pl_pl: Warunek oberwacji

source: ObservationConditionScreenTip
pl_pl: Warunek logiczny, który musi być prawdziwy dla przynajmniej jednege potencjalnego efektu wykonania danej akcji.

source: ObservationStatement
pl_pl: Zdanie obserwacji

source: ObservationStatementScreenTip
pl_pl: Określa, że podany warunek logiczny jest spełniony przynajmniej w jednym przypadku po wykonaniu danej akcji.

source: OptionsTab
pl_pl: Opcje

source: Postcondition
pl_pl: Warunek końcowy

source: PostconditionScreenTip
pl_pl: Warunek logiczny określający efekt wykonania akcji.

source: Precondition
pl_pl: Warunek wstępny

source: PreconditionScreenTip
pl_pl: Warunek logiczny, który musi być spełniony, aby zdanie miało efekt.

source: ProgramScreenTip
pl_pl: Sekwencja akcji złożonych, której dotyczy kwerenda.

source: QueryClauseGroupBox
pl_pl: Kwerendy

source: SystemGroupBox
pl_pl: System dynamiczny

source: Target
pl_pl: Cel

source: TargetScreenTip
pl_pl: Warunek logiczny, który powinien zostać spełniony.

source: TruthButton
pl_pl: Prawda

source: TruthButtonScreenTip
pl_pl: Wstawia stałą prawdy do wybranej formuły logicznej.

source: UnconditionalEffectStatement
pl_pl: Bezwarunkowe zdanie efektu

source: UnconditionalEffectStatementScreenTip
pl_pl: Opisuje pewne efekty akcji.

source: UnconditionalFluentReleaseStatement
pl_pl: Bezwarunkowe zdanie uwolnienia fluentu

source: UnconditionalFluentReleaseStatementScreenTip
pl_pl: Opisuje losowe efekty akcji.

source: UnconditionalImpossibilityStatement
pl_pl: Bezwarunkowe zdanie niemożliwości

source: UnconditionalImpossibilityStatementScreenTip
pl_pl: Zapobiega wykonaniu danej akcji.

source: ValueCondition
pl_pl: Warunek wartości

source: ValueConditionScreenTip
pl_pl: Warunek logiczny, który musi być spełniony zawsze po wykonaniu danej akcji.

source: ValueQuery
pl_pl: Kwerendy wartości

source: ValueStatement
pl_pl: Zdanie wartości

source: ValueStatementScreenTip
pl_pl: Określa, że podany warunek logiczny jest spełniony zawsze po wykonaniu danej akcji.

source: WindowTitle
pl_pl: Akcje równoległe
